In [1]:
import numpy as np
import pandas as pd

## Creating the Sample Data Frame

In [2]:
student_data = pd.DataFrame({'school_code': ['s001','s002','s003','s001','s002','s004'],
                             'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
                             'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton',
                                      'Gino Mcneill', 'David Parkes'],
                             'date_Of_Birth ':['15/05/2002','17/05/2002','16/02/1999','25/09/1998',
                                               '11/05/2002','15/09/1997'],
                             'age': [12, 12, 13, 13, 14, 12],
                             'height': [173, 192, 186, 167, 151, 159],
                             'weight': [35, 32, 33, 30, 31, 32],
                             'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
                            index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
student_data

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

# Question 1.) Write a Pandas program to split the following dataframe by school code and get mean, min, and max value of age for each school.

In [3]:
result_1 = student_data.groupby('school_code').agg({'age' : ['mean', 'min', 'max']})
result_1

              age
             mean min max
school_code
s001         12.5  12  13
s002         13.0  12  14
s003         13.0  13  13
s004         12.0  12  12

# Question 2.) Write a Pandas program to split the following dataframe by school code and get median, variance, and standard deviation of age for each school.

In [4]:
result_2 = student_data.groupby('school_code').agg({'age' : ['median', 'std', 'var']})
result_2

               age
            median       std  var
school_code
s001          12.5  0.707107  0.5
s002          13.0  1.414214  2.0
s003          13.0       NaN  NaN
s004          12.0       NaN  NaN

# Question 3.) Write a Pandas program to split the following dataframe into groups by school code and get mean, min, and max value of age with customized column name for each school.

In [5]:
result_3 = student_data.groupby('school_code').agg(Age_Mean = ('age','mean'),
                                                   Age_Max = ('age','min'),
                                                   Age_Min = ('age','max'))
result_3

             Age_Mean  Age_Max  Age_Min
school_code
s001             12.5       12       13
s002             13.0       12       14
s003             13.0       13       13
s004             12.0       12       12

## Creating the Data Frame for the next question.

In [6]:
df = pd.DataFrame(data={'Animal': ['fox', 'Kangaroo', 'deer', 'spider', 'snake'],
                        'Number_legs': [4, 2, 4, 8, np.nan]})
df

     Animal  Number_legs
0       fox          4.0
1  Kangaroo          2.0
2      deer          4.0
3    spider          8.0
4     snake          NaN

# Question 4.) Calculate the rank for the above dataframe.

In [7]:
df['Rank'] = df['Number_legs'].rank()
df.sort_values(by = 'Number_legs')

     Animal  Number_legs  Rank
1  Kangaroo          2.0   1.0
0       fox          4.0   2.5
2      deer          4.0   2.5
3    spider          8.0   4.0
4     snake          NaN   NaN